# Assignment on Pandas(Advanced) (24.2.23)

In [1]:
import pandas as pd
import csv

In [2]:
print(dir(pd))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__deprecated_num_index_names', '__dir__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [3]:
'''Q1. List any five functions of the pandas library with execution.

Ans - 1. read_csv() · 2. head() · 3. describe() · 4. memory_usage() · 5. astype() · 6. loc[:] · 7. to_datetime() · 
    8. value_counts().

'''
iris = 'http://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'

In [4]:
df_iris = pd.read_csv(iris,header = None)

In [5]:
df_iris.head()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [6]:
df_iris.tail()

       0    1    2    3               4
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [7]:
df_iris.columns

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [8]:
df_iris.describe()

                0           1           2           3
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [9]:
df_iris.dtypes

0    float64
1    float64
2    float64
3    float64
4     object
dtype: object

In [10]:
'''Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.'''

df = pd.DataFrame({"A":[0,1,2],"B":["a","b","c"],"C":["alpha","beta","gamma"]})

In [11]:
def reindexing(df):
    df["index_column"] = [i for i in range(1,len(df)+len(df),2)]
    df.set_index("index_column", inplace = True)
    return df

In [12]:
[i for i in range(1,20,2)]

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [13]:
reindexing(df)

              A  B      C
index_column
1             0  a  alpha
3             1  b   beta
5             2  c  gamma

In [14]:
'''Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.'''

df1 = pd.DataFrame({"Values":(10, 20, 30, 40, 50)})

In [15]:
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [16]:
reindexing(df1)

              Values
index_column
1                 10
3                 20
5                 30
7                 40
9                 50

In [17]:
# Main Answer with Functional Code

def add(df):
    return (sum(df["Values"].iloc[0:3]))

In [18]:
add(df1)

60

In [19]:
df2 = pd.DataFrame({"Values":[1,2,3,4,5]})

In [20]:
add(df2)

6

In [21]:
'''Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.
'''

df_titanic = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [22]:
df_titanic["Word_Count"]  = df_titanic["Name"].apply(lambda x: len(x.split()))

In [23]:
df_titanic[["Name","Word_Count"]].head()

                                                Name  Word_Count
0                            Braund, Mr. Owen Harris           4
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           7
2                             Heikkinen, Miss. Laina           3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           7
4                           Allen, Mr. William Henry           4

In [24]:
'''Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans - pd.DataFrame.size returns an int representing the number of elements in this object. Return the number of rows if Series.
    Otherwise return the number of rows times number of columns if DataFrame.

    While pd.DataFrame.shape returns a tuple representing the dimensionality of the DataFrame.'''

'Q5. How are DataFrame.size() and DataFrame.shape() different?\n\nAns - pd.DataFrame.size returns an int representing the number of elements in this object. Return the number of rows if Series.\n    Otherwise return the number of rows times number of columns if DataFrame.\n\n    While pd.DataFrame.shape returns a tuple representing the dimensionality of the DataFrame.'

In [25]:

'''Q6. Which function of pandas do we use to read an excel file?

Ans - pd.read_excel is the function used in pandas to read an excel file.'''

'Q6. Which function of pandas do we use to read an excel file?\n\nAns - pd.read_excel is the function used in pandas to read an excel file.'

In [26]:
'''Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

'''

data = pd.DataFrame({"Name":["John Brown", "Jack White"],
                    "Email":["john.brown@gmail.com", "jack.white@hotmail.com"]})

In [27]:
data

         Name                   Email
0  John Brown    john.brown@gmail.com
1  Jack White  jack.white@hotmail.com

In [28]:
data["Username"] = data["Email"].aggregate(lambda x: x.split("@")[0])

In [29]:
data

         Name                   Email    Username
0  John Brown    john.brown@gmail.com  john.brown
1  Jack White  jack.white@hotmail.com  jack.white

In [30]:
'''Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.'''

data1 = pd.DataFrame({"A":[3,8,6,2,9], "B":[5,2,9,3,1],"C":[1,7,4,5,2]})

In [31]:
data1

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [32]:
data1[(data1["A"] > 5) & (data1["B"] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [33]:
def filter_df(df):
    return df[(df["A"] > 5) & (df["B"] < 10)]

In [34]:
filter_df(data1)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [35]:
'''Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

'''

"Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,\nmedian, and standard deviation of the values in the 'Values' column.\n\n"

In [36]:
def mean(df):
    return df["Values"].mean()

In [37]:
mean(df1)

30.0

In [38]:
mean(df2)

3.0

In [39]:
def median(df):
    return df["Values"].median()

In [40]:
median(df1)

30.0

In [41]:
median(df2)

3.0

In [42]:
def std(df):
    return df["Values"].std()

In [43]:
std(df1)

15.811388300841896

In [44]:
std(df2)

1.5811388300841898

In [45]:
# A moving average is a technical indicator that investors and traders use to determine the trend direction of securities.
# It is calculated by adding up all the data points during a specific period and dividing the sum by the number of time  periods.

In [46]:
'''Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.'''

df_sales = pd.DataFrame({"Sales":[45,55,60,75,35,42,58,66,78,20],
                        "Date":['2023-02-23', '2023-02-24', '2023-02-25', '2023-02-26','2023-02-27', 
                                '2023-02-28', '2023-03-01', '2023-03-02','2023-03-03', '2023-03-04']})

In [47]:
def moving_avg(df):
    df["MovingAverage"] = df["Sales"].rolling(window=7).mean()
    return df

In [48]:
df_sales.mean(numeric_only=True)

Sales    53.4
dtype: float64

In [49]:
moving_avg(df_sales)

   Sales        Date  MovingAverage
0     45  2023-02-23            NaN
1     55  2023-02-24            NaN
2     60  2023-02-25            NaN
3     75  2023-02-26            NaN
4     35  2023-02-27            NaN
5     42  2023-02-28            NaN
6     58  2023-03-01      52.857143
7     66  2023-03-02      55.857143
8     78  2023-03-03      59.142857
9     20  2023-03-04      53.428571

In [50]:
'''Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.'''

date = pd.DataFrame({"Date":['2023-02-23', '2023-02-24', '2023-02-25', '2023-02-26','2023-02-27', 
                                '2023-02-28', '2023-03-01', '2023-03-02','2023-03-03', '2023-03-04']})

In [51]:
df_date = pd.to_datetime(date["Date"])

In [52]:
date.columns

Index(['Date'], dtype='object')

In [53]:
def weekday(df):
    df["Weekday"] = (pd.to_datetime(df["Date"])).dt.strftime('%A')
    return df

In [54]:
weekday(date)

         Date    Weekday
0  2023-02-23   Thursday
1  2023-02-24     Friday
2  2023-02-25   Saturday
3  2023-02-26     Sunday
4  2023-02-27     Monday
5  2023-02-28    Tuesday
6  2023-03-01  Wednesday
7  2023-03-02   Thursday
8  2023-03-03     Friday
9  2023-03-04   Saturday

In [55]:
'''Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
'''
df_course_duration = pd.DataFrame({"Date":pd.date_range(start = '2023-01-28' ,end = '2023-08-15')})

In [56]:
df_course_duration

          Date
0   2023-01-28
1   2023-01-29
2   2023-01-30
3   2023-01-31
4   2023-02-01
..         ...
195 2023-08-11
196 2023-08-12
197 2023-08-13
198 2023-08-14
199 2023-08-15

[200 rows x 1 columns]

In [57]:
type(df_course_duration)

pandas.core.frame.DataFrame

In [58]:
course_duration = pd.to_datetime(df_course_duration["Date"])

In [59]:
course_duration

0     2023-01-28
1     2023-01-29
2     2023-01-30
3     2023-01-31
4     2023-02-01
         ...
195   2023-08-11
196   2023-08-12
197   2023-08-13
198   2023-08-14
199   2023-08-15
Name: Date, Length: 200, dtype: datetime64[ns]

In [60]:
def date_selection(df):
    df['Date'] = pd.to_datetime(df['Date'])
    return df.loc[(df['Date'] > '2023-01-01') & (df['Date'] <= '2023-01-31')]

In [61]:
date_selection(df_course_duration)

        Date
0 2023-01-28
1 2023-01-29
2 2023-01-30
3 2023-01-31

In [62]:
'''Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans - To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported is
        pandas.
'''

'Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to\nbe imported?\n\nAns - To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported is\n        pandas\n'